# How do I select a pandas Series from a DataFrame?

Video: https://www.youtube.com/watch?v=zxqjeyKP2Tk&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y&index=3

2 basic object types that hold data in pandas:
1. series
2. dataframe
    * table of rows an columns
    * series : each column is called a series

In [1]:
import pandas as pd

In [3]:
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')

note: you can also use pd.read_csv. <br />
The only difference between read_table and read_csv is that csv uses the comma as the separator <br />
ufo = pd.read_csv('http://bit.ly/uforeports')

In [ ]:
#use to confirm that this is in fact a DataFrame
type(ufo)

In [10]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### Braket notation:

In [ ]:
#is case sensitive
ufo['City']
ufo['Colors Report']

### Dot notation:

In [ ]:
#everytime I add a column (series) to a dataframe it's name automatically becomes an attribute of the object
# if there is a space in the name as in "Colors Reported" the dot notation simply does not work!
# this is also the case if you name a column that conflicts with a built in attributeor function
ufo.City

### How to create a new series in a DataFrame

In [ ]:
#concatenate series
# in regular python 'ab'+'cd'
ufo.City + ', '+ ufo.State

In [17]:
ufo['Location'] = ufo.City + ', '+ ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

### Other notes:

In [13]:
# to get the shape
ufo.shape

(18241, 5)